選單類型 = input("請選擇轉換類型 (1: 攝氏與華氏, 2: 公里與英里, 3: 公斤與磅): ")

if 選單類型 == '1':
    x = input('選擇 A: 攝氏轉華氏, B: 華氏轉攝氏:')
    if x == 'A':
        攝氏 = float(input('請輸入攝氏溫度: '))
        華氏 = (攝氏 * 9/5) + 32
        print(f'華氏溫度為: {華氏:.2f}')
    elif x == 'B':
        華氏 = float(input('請輸入華氏溫度: '))
        攝氏 = (華氏 - 32) * 5/9
        print(f'攝氏溫度為: {攝氏:.2f}')

elif 選單類型 == '2':
    y = input('選擇 A: 公里轉英里, B: 英里轉公里')
    if y == 'A':
        公里 = float(input('請輸入公里數: '))
        英里 = 公里 * 0.6214
        print(f'英里數為: {英里:.2f}')
    elif y == 'B':
        英里 = float(input('請輸入英里數: '))
        公里 = 英里 / 0.6214
        print(f'公里數為: {公里:.2f}')

elif 選單類型 == '3':
    z = input('選擇 A: 公斤轉磅, B: 磅轉公斤')
    if z == 'A':
        公斤 = float(input('請輸入公斤數: '))
        磅 = 公斤 * 2.2046
        print(f'磅數為: {磅:.2f}')
    elif z == 'B':
        磅 = float(input('請輸入磅數: '))
        公斤 = 磅 / 2.2046
        print(f'公斤數為: {公斤:.2f}')
else:
    print('無效的選擇。')