# 輸入一個整數，先只印出 n % 2 的值，觀察它與奇偶的關係。

integer = int(input( 'integer = '))
print('remainder = ' ,integer % 2)

""" 如果是偶數 = 0 ，是奇數的話 = 1 """

# 輸入秒數 (例如 3725)，輸出 [ 一小時兩分五秒 ]。

s = int(input( 'second = ' ))
h = s / 3600 
print('h = 'f'{h:.0f}')
m = s % 3600 / 60
print('m = 'f'{m:.0f}')
s2 = s % 3600 % 60
print('s = ',s2)

print('second = ', f'{h:.0f}','小時', f'{m:.0f}','分鐘',s2 ,'秒') 


# 先不要執行，猜出下列四式的結果與型別，再驗證 :
# 10 / 3 ， 10 // 3 ， 10 % 3 ， 10 ** 3

"""
猜
10 / 3 : 3.333333...
10 // 3 : 3
10 % 3 : 1
10 ** 3 : 不知道
"""
print(10 / 3)
print(10 // 3)
print(10 % 3)
print(10 ** 3)

"""
10 / 3 : 3.333333...
10 // 3 : 3
10 % 3 : 1
10 ** 3 : 1000
"""
